tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
/***********************************************************************
 * File         :     ESP32S3_8DI8DO.c
 * Description  :     Unified library implementation for ESP32-S3-POE-ETH-8DI-8DO board
 * Author       :     Tenergy Innovation Co., Ltd.
 * Date         :     28 Jun 2026
 * Revision     :     1.0.0 (Consolidated)
 * Email        :     uten.boonliam@tenergyinnovation.co.th
 ***********************************************************************/

#include "ESP32S3_8DI8DO.h"

// ============================================================
// STATIC MEMBER DEFINITIONS
// ============================================================
const uint8_t ESP32S3_8DI8DO::RGB_LED_PIN = 38;
const uint8_t ESP32S3_8DI8DO::BUZZER_PIN = 46;
const uint8_t ESP32S3_8DI8DO::RS485_TX_PIN = 17;
const uint8_t ESP32S3_8DI8DO::RS485_RX_PIN = 18;
const uint8_t ESP32S3_8DI8DO::CAN_TX_PIN = 0;
const uint8_t ESP32S3_8DI8DO::CAN_RX_PIN = 1;

// DI_PINS array definition
constexpr uint8_t ESP32S3_DI::DI_PINS[8];

// ============================================================
// STATIC TICKER MEMBER INITIALIZATION (for LED animations)
// ============================================================
Ticker ESP32S3_RGB::_tickerRed;
Ticker ESP32S3_RGB::_tickerGreen;
Ticker ESP32S3_RGB::_tickerBlue;
Ticker ESP32S3_RGB::_tickerYellow;
Ticker ESP32S3_RGB::_tickerPurple;
Ticker ESP32S3_RGB::_tickerOrange;
Ticker ESP32S3_RGB::_tickerWhite;

ESP32S3_RGB *ESP32S3_RGB::_instance = nullptr;

// ============================================================
// SECTION 1: DIGITAL INPUT (DI) IMPLEMENTATION
// ============================================================

ESP32S3_DI::ESP32S3_DI() 
    : _currentState(0), _previousState(0) {
    memset(_debounceTime, DEFAULT_DEBOUNCE_MS, CHANNELS);
    memset(_lastChangeTime, 0, sizeof(_lastChangeTime));
    memset(_debounceEnabled, false, CHANNELS);
    memset(_inputMode, INPUT_NORMAL, CHANNELS);
    memset(_callbacks, 0, sizeof(_callbacks));
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::begin
 * DESCRIPTION: Initializes the ESP32S3_DI class. Sets up GPIO pins and internal state variables.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
bool ESP32S3_DI::begin() {
    _initializeGPIO();
    return true;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::read
 * DESCRIPTION: Reads the state of a specific digital input channel.
 * PARAMETERS:  channel - The digital input channel to read.
 * RETURNED:    true if the input is HIGH, false otherwise.
 ***********************************************************************/
bool ESP32S3_DI::read(uint8_t channel) {
    if (!_validateChannel(channel)) return false;
    channel = _normalizeChannel(channel);
    return digitalRead(DI_PINS[channel]) == HIGH;
}


/***********************************************************************
 * FUNCTION:    ESP32S3_DI::readAll
 * DESCRIPTION: Reads the state of all 8 digital input channels at once.
 * PARAMETERS:  None
 * RETURNED:    uint8_t - Bitmask representing all 8 channels (bit 0 = CH0, bit 7 = CH7)
 ***********************************************************************/
uint8_t ESP32S3_DI::readAll() {
    uint8_t result = 0;
    for (int i = 0; i < CHANNELS; i++) {
        if (digitalRead(DI_PINS[i]) == HIGH) {
            result |= (1 << i);
        }
    }
    return result;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::getState
 * DESCRIPTION: Gets the cached state of a specific digital input channel.
 *              Returns the state from the last update() call (debounced).
 * PARAMETERS:  channel - The digital input channel (0-7)
 * RETURNED:    true if input is HIGH, false if LOW
 ***********************************************************************/
bool ESP32S3_DI::getState(uint8_t channel) {
    if (!_validateChannel(channel)) return false;
    channel = _normalizeChannel(channel);
    return (_currentState >> channel) & 1;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::setChangeCallback
 * DESCRIPTION: Registers a callback function to be called when a channel state changes.
 * PARAMETERS:  channel - The digital input channel (0-7)
 *              callback - Function pointer with signature: void callback(uint8_t ch, bool newState)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_DI::setChangeCallback(uint8_t channel, void (*callback)(uint8_t, bool)) {
    if (!_validateChannel(channel)) return;
    channel = _normalizeChannel(channel);
    _callbacks[channel] = callback;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::enableDebounce
 * DESCRIPTION: Enables debouncing on a specific digital input channel.
 *              Debouncing filters out noise by requiring stable state for a set time.
 * PARAMETERS:  channel - The digital input channel (0-7)
 *              milliseconds - Debounce time in milliseconds (default: 20ms)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_DI::enableDebounce(uint8_t channel, uint8_t milliseconds) {
    if (!_validateChannel(channel)) return;
    channel = _normalizeChannel(channel);
    _debounceEnabled[channel] = true;
    _debounceTime[channel] = milliseconds;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::disableDebounce
 * DESCRIPTION: Disables debouncing on a specific digital input channel.
 * PARAMETERS:  channel - The digital input channel (0-7)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_DI::disableDebounce(uint8_t channel) {
    if (!_validateChannel(channel)) return;
    channel = _normalizeChannel(channel);
    _debounceEnabled[channel] = false;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::getDebounceTime
 * DESCRIPTION: Gets the current debounce time setting for a channel.
 * PARAMETERS:  channel - The digital input channel (0-7)
 * RETURNED:    uint8_t - Debounce time in milliseconds
 ***********************************************************************/
uint8_t ESP32S3_DI::getDebounceTime(uint8_t channel) {
    if (!_validateChannel(channel)) return 0;
    channel = _normalizeChannel(channel);
    return _debounceTime[channel];
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::setInputMode
 * DESCRIPTION: Sets the input mode (normal or inverted) for a specific channel.
 * PARAMETERS:  channel - The digital input channel (0-7)
 *              mode - INPUT_NORMAL (HIGH=on) or INPUT_INVERTED (LOW=on)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_DI::setInputMode(uint8_t channel, InputMode mode) {
    if (!_validateChannel(channel)) return;
    channel = _normalizeChannel(channel);
    _inputMode[channel] = mode;
}

