tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
bool ESP32S3_DI::enableInterrupt(uint8_t channel) {
    // TODO: Implement interrupt-based detection
    return false;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DI::update
 * DESCRIPTION: Updates all channel states and processes debouncing.
 *              Must be called regularly in the main loop for proper operation.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_DI::update() {
    _currentState = readAll();
    
    // Check each channel for state changes
    for (int i = 0; i < CHANNELS; i++) {
        bool currentBit = (_currentState >> i) & 1;
        bool previousBit = (_previousState >> i) & 1;
        
        if (currentBit != previousBit) {
            // State change detected
            if (_debounceEnabled[i]) {
                unsigned long now = millis();
                if (now - _lastChangeTime[i] < _debounceTime[i]) {
                    continue;  // Skip if within debounce time
                }
                _lastChangeTime[i] = now;
            }
            
            // Apply input mode (invert if needed)
            bool reportedState = currentBit;
            if (_inputMode[i] == INPUT_INVERTED) {
                reportedState = !reportedState;
            }
            
            // Call callback if registered
            if (_callbacks[i] != nullptr) {
                _callbacks[i](i, reportedState);
            }
        }
    }
    
    _previousState = _currentState;
}

void ESP32S3_DI::_initializeGPIO() {
    for (int i = 0; i < CHANNELS; i++) {
        pinMode(DI_PINS[i], INPUT);
    }
}

bool ESP32S3_DI::_validateChannel(uint8_t channel) {
    return (channel < CHANNELS) || (channel >= 1 && channel <= 8);
}

uint8_t ESP32S3_DI::_normalizeChannel(uint8_t channel) {
    return (channel >= 1 && channel <= 8) ? (channel - 1) : channel;
}

// ============================================================
// SECTION 2: DIGITAL OUTPUT (DO) IMPLEMENTATION
// ============================================================

ESP32S3_DO::ESP32S3_DO() : _outputState(0) {}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::begin
 * DESCRIPTION: Initializes the digital output controller via I2C.
 *              Configures the TCA9554 I/O expander for relay control.
 * PARAMETERS:  None
 * RETURNED:    bool - true if initialization successful, false otherwise
 ***********************************************************************/
bool ESP32S3_DO::begin() {
    Wire.begin(SDA_PIN, SCL_PIN);
    
    // Configure TCA9554 as outputs
    _writeRegister(REG_CONFIG, 0x00);  // All pins as outputs
    _writeRegister(REG_OUTPUT_PORT, 0xFF);  // All off initially
    _outputState = 0xFF;  // ← Sync internal state with hardware!
    
    return isConnected();
}

bool ESP32S3_DO::set(uint8_t channel, OutputState state) {
    if (channel >= CHANNELS) return false;
    
    if (state == OUTPUT_TOGGLE) {
        _outputState ^= (1 << channel);
    } else if (state == OUTPUT_ON) {
        _outputState &= ~(1 << channel);  // Register: 0 = ON
    } else {
        _outputState |= (1 << channel);   // Register: 1 = OFF
    }
    
    return _writeRegister(REG_OUTPUT_PORT, _outputState);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::on
 * DESCRIPTION: Turns on (activates) a specific digital output relay.
 * PARAMETERS:  channel - The digital output channel (0-7)
 * RETURNED:    bool - true if successful, false if invalid channel
 ***********************************************************************/
bool ESP32S3_DO::on(uint8_t channel) {
    return set(channel, OUTPUT_ON);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::off
 * DESCRIPTION: Turns off (deactivates) a specific digital output relay.
 * PARAMETERS:  channel - The digital output channel (0-7)
 * RETURNED:    bool - true if successful, false if invalid channel
 ***********************************************************************/
bool ESP32S3_DO::off(uint8_t channel) {
    return set(channel, OUTPUT_OFF);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::toggle
 * DESCRIPTION: Toggles the state of a specific digital output relay.
 * PARAMETERS:  channel - The digital output channel (0-7)
 * RETURNED:    bool - true if successful, false if invalid channel
 ***********************************************************************/
bool ESP32S3_DO::toggle(uint8_t channel) {
    return set(channel, OUTPUT_TOGGLE);
}

bool ESP32S3_DO::getState(uint8_t channel) {
    if (channel >= CHANNELS) return false;
    return ((_outputState >> channel) & 1) == 0;  // 0 = ON
}

uint8_t ESP32S3_DO::getMask() {
    return ~_outputState;  // Invert for user interface
}

uint8_t ESP32S3_DO::getRawState() {
    return _outputState;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::setMask
 * DESCRIPTION: Sets multiple output relays at once using a bitmask.
 * PARAMETERS:  mask - Bitmask where bit=1 means ON, bit=0 means OFF
 * RETURNED:    bool - true if successful, false otherwise
 ***********************************************************************/
bool ESP32S3_DO::setMask(uint8_t mask) {
    _outputState = ~mask;  // Invert for register
    return _writeRegister(REG_OUTPUT_PORT, _outputState);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::allOn
 * DESCRIPTION: Turns on all 8 digital output relays simultaneously.
 * PARAMETERS:  None
 * RETURNED:    bool - true if successful, false otherwise
 ***********************************************************************/
bool ESP32S3_DO::allOn() {
    _outputState = 0x00;
    return _writeRegister(REG_OUTPUT_PORT, _outputState);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::allOff
 * DESCRIPTION: Turns off all 8 digital output relays simultaneously.
 * PARAMETERS:  None
 * RETURNED:    bool - true if successful, false otherwise
 ***********************************************************************/
bool ESP32S3_DO::allOff() {
    _outputState = 0xFF;
    return _writeRegister(REG_OUTPUT_PORT, _outputState);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_DO::isConnected
 * DESCRIPTION: Checks if the TCA9554 I/O expander is connected on I2C bus.
 * PARAMETERS:  None
 * RETURNED:    bool - true if device responds to I2C address, false otherwise
 ***********************************************************************/
bool ESP32S3_DO::isConnected() {
    Wire.beginTransmission(I2C_ADDRESS);
    return Wire.endTransmission() == 0;
}

