tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
bool ESP32S3_DO::setPolarity(uint8_t channel, bool inverted) {
    uint8_t polarity;
    if (!_readRegister(REG_POLARITY, polarity)) return false;
    
    if (inverted) {
        polarity |= (1 << channel);
    } else {
        polarity &= ~(1 << channel);
    }
    
    return _writeRegister(REG_POLARITY, polarity);
}

bool ESP32S3_DO::setEnabled(uint8_t channel, bool enabled) {
    // For DO, all channels are always enabled, but we can control output
    return enabled ? on(channel) : off(channel);
}

bool ESP32S3_DO::_writeRegister(uint8_t reg, uint8_t value) {
    Wire.beginTransmission(I2C_ADDRESS);
    Wire.write(reg);
    Wire.write(value);
    return Wire.endTransmission() == 0;
}

bool ESP32S3_DO::_readRegister(uint8_t reg, uint8_t &value) {
    Wire.beginTransmission(I2C_ADDRESS);
    Wire.write(reg);
    if (Wire.endTransmission() != 0) return false;
    
    if (Wire.requestFrom(I2C_ADDRESS, 1) != 1) return false;
    value = Wire.read();
    return true;
}

// ============================================================
// SECTION 3: RS485 IMPLEMENTATION
// ============================================================

ESP32S3_RS485::ESP32S3_RS485()
    : _baudrate(9600), _commMode(MODE_AT_COMMAND), _serial(&Serial1),
      _rxIndex(0), _lastRxTime(0), _dataCallback(nullptr),
      _bytesSent(0), _bytesReceived(0) {}

bool ESP32S3_RS485::begin(unsigned long baudrate, CommMode mode) {
    _baudrate = baudrate;
    _commMode = mode;
    _initializeUART();
    return true;
}

void ESP32S3_RS485::end() {
    _serial->end();
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::write
 * DESCRIPTION: Writes raw binary data to the RS485 interface.
 * PARAMETERS:  data - Pointer to byte array to send
 *              length - Number of bytes to send
 * RETURNED:    size_t - Number of bytes successfully written
 ***********************************************************************/
size_t ESP32S3_RS485::write(const uint8_t* data, size_t length) {
    size_t written = _serial->write(data, length);
    _bytesSent += written;
    return written;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::writeString
 * DESCRIPTION: Writes a string to the RS485 interface.
 * PARAMETERS:  str - Null-terminated string to send
 * RETURNED:    size_t - Number of bytes successfully written
 ***********************************************************************/
size_t ESP32S3_RS485::writeString(const char* str) {
    size_t written = _serial->print(str);
    _bytesSent += written;
    return written;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::read
 * DESCRIPTION: Reads available data from the RS485 interface into a buffer.
 * PARAMETERS:  buffer - Pointer to byte array to store received data
 *              maxLength - Maximum number of bytes to read
 * RETURNED:    size_t - Number of bytes actually read
 ***********************************************************************/
size_t ESP32S3_RS485::read(uint8_t* buffer, size_t maxLength) {
    size_t count = 0;
    while (_serial->available() && count < maxLength) {
        buffer[count++] = _serial->read();
    }
    _bytesReceived += count;
    return count;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::available
 * DESCRIPTION: Checks how many bytes are available to read from RS485 buffer.
 * PARAMETERS:  None
 * RETURNED:    size_t - Number of bytes available to read
 ***********************************************************************/
size_t ESP32S3_RS485::available() {
    return _serial->available();
}

int ESP32S3_RS485::peek() {
    return _serial->peek();
}

void ESP32S3_RS485::flush() {
    _serial->flush();
}

void ESP32S3_RS485::clearRxBuffer() {
    while (_serial->available()) {
        _serial->read();
    }
    _rxIndex = 0;
}

void ESP32S3_RS485::setDataCallback(void (*callback)(uint8_t*, size_t)) {
    _dataCallback = callback;
}

void ESP32S3_RS485::setCommMode(CommMode mode) {
    _commMode = mode;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::changeBaudrate
 * DESCRIPTION: Changes the baud rate of the RS485 serial connection.
 * PARAMETERS:  baudrate - New baud rate (9600, 14400, 19200, 38400, 57600, 115200)
 * RETURNED:    bool - Always returns true if operation completed
 ***********************************************************************/
bool ESP32S3_RS485::changeBaudrate(unsigned long baudrate) {
    _baudrate = baudrate;
    _serial->begin(_baudrate, SERIAL_8N1, RX_PIN, TX_PIN);
    return true;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RS485::sendATCommand
 * DESCRIPTION: Sends an AT command to RS485 device and waits for response.
 * PARAMETERS:  command - AT command string to send
 *              timeout - Time to wait for response in milliseconds
 * RETURNED:    String - Response from the device
 ***********************************************************************/
String ESP32S3_RS485::sendATCommand(const char* command, uint16_t timeout) {
    String response = "";
    unsigned long startTime = millis();
    
    // Send command
    _serial->print(command);
    _serial->print("\r\n");
    
    // Wait for response
    while (millis() - startTime < timeout) {
        if (_serial->available()) {
            char c = _serial->read();
            response += c;
            startTime = millis();  // Reset timeout on each character
        }
    }
    
    return response;
}

void ESP32S3_RS485::resetStats() {
    _bytesSent = 0;
    _bytesReceived = 0;
}

void ESP32S3_RS485::update() {
    _processRxBuffer();
}

void ESP32S3_RS485::_initializeUART() {
    _serial->begin(_baudrate, SERIAL_8N1, RX_PIN, TX_PIN);
    delay(100);
}

void ESP32S3_RS485::_processRxBuffer() {
    while (_serial->available()) {
        uint8_t byte = _serial->read();
        _rxBuffer[_rxIndex++] = byte;
        _lastRxTime = millis();
        
        if (_rxIndex >= BUFFER_SIZE) {
            _rxIndex = 0;
        }
    }
    
    // Call callback if complete message received
    if (_rxIndex > 0 && (millis() - _lastRxTime) > 10) {
        if (_dataCallback != nullptr) {
            _dataCallback(_rxBuffer, _rxIndex);
        }
        _rxIndex = 0;
    }
}

