tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
// ============================================================
// SECTION 4: RGB LED IMPLEMENTATION
// ============================================================

ESP32S3_RGB::ESP32S3_RGB()
    : _currentColor(0), _targetColor(0), _brightness(255),
      _animMode(ANIM_SOLID), _lastUpdateTime(0),
      _blinkOnTime(500), _blinkOffTime(500), _blinkCount(0),
      _neoPixel(nullptr) {}

bool ESP32S3_RGB::begin() {
    // Initialize NeoPixel object for WS2812B LED on GPIO38
    _neoPixel = new Adafruit_NeoPixel(NUM_LEDS, RGB_PIN, NEO_GRB + NEO_KHZ800);
    
    if (_neoPixel == nullptr) {
        return false;
    }
    
    _neoPixel->begin();
    _neoPixel->show();  // Initialize with all LEDs off
    _instance = this;   // Register instance for static Ticker callbacks
    return true;
}

void ESP32S3_RGB::end() {
    _stopAllLEDs();  // Detach all Tickers
    if (_neoPixel != nullptr) {
        _neoPixel->clear();
        _neoPixel->show();
        delete _neoPixel;
        _neoPixel = nullptr;
    }
    _instance = nullptr;  // Clear instance pointer
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::setColor
 * DESCRIPTION: Sets the RGB LED to a specific color.
 *              Input uses RGB format (0xRRGGBB), automatically converted
 *              to GRB format for WS2812B NeoPixel LED.
 * PARAMETERS:  red - Red component (0-255)
 *              green - Green component (0-255)
 *              blue - Blue component (0-255)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::setColor(uint8_t red, uint8_t green, uint8_t blue) {
    _targetColor = ((uint32_t)red << 16) | ((uint32_t)green << 8) | blue;
    _currentColor = _targetColor;
    _animMode = ANIM_SOLID;
    _updateLED();  // Update immediately
}

void ESP32S3_RGB::setColor(uint32_t color) {
    _targetColor = color;
    _currentColor = color;
    _animMode = ANIM_SOLID;
    _updateLED();  // Update immediately
}

void ESP32S3_RGB::setStatusColor(StatusColor status) {
    setColor((uint32_t)status);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::blink
 * DESCRIPTION: Makes the RGB LED blink at a specified interval.
 * PARAMETERS:  color - 24-bit RGB color value (0xRRGGBB)
 *              onTime - Time LED is ON in milliseconds
 *              offTime - Time LED is OFF in milliseconds
 *              count - Number of blinks (0 = infinite)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::blink(uint32_t color, uint16_t onTime, uint16_t offTime, uint16_t count) {
    setColor(color);
    _blinkOnTime = onTime;
    _blinkOffTime = offTime;
    _blinkCount = count;
    _animMode = ANIM_BLINK;
    _lastUpdateTime = millis();
}

void ESP32S3_RGB::blinkStatus(StatusColor status, uint16_t interval, uint16_t count) {
    blink((uint32_t)status, interval / 2, interval / 2, count);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::pulse
 * DESCRIPTION: Makes the RGB LED pulse (fade in/out) continuously.
 * PARAMETERS:  color - 24-bit RGB color value (0xRRGGBB)
 *              period - Complete pulse cycle time in milliseconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::pulse(uint32_t color, uint16_t period) {
    setColor(color);
    _blinkOnTime = period;
    _animMode = ANIM_PULSE;
    _lastUpdateTime = millis();
}

void ESP32S3_RGB::strobe(uint32_t color, uint8_t speed) {
    setColor(color);
    _blinkOnTime = 1000 / speed / 2;
    _animMode = ANIM_STROBE;
    _lastUpdateTime = millis();
}

void ESP32S3_RGB::breathe(uint32_t color, uint16_t period) {
    setColor(color);
    _blinkOnTime = period;
    _animMode = ANIM_BREATHE;
    _lastUpdateTime = millis();
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::stop
 * DESCRIPTION: Stops all LED animations and keeps the current color on.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::stop() {
    _animMode = ANIM_SOLID;
    _currentColor = _targetColor;
}

/***********************************************************************
 * FUNCTION:    tickRedLED - Ticker-based blinking (non-blocking)
 * DESCRIPTION: Makes RGB LED blink red using FreeRTOS Ticker.
 *              Animation runs in background ISR context.
 * PARAMETERS:  seconds - Blink interval in seconds (ON/OFF each = seconds/2)
 *              Pass 0 to turn off.
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::tickRedLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_RED;
        _updateLED();
        _tickerRed.attach(seconds / 2.0, _toggleRedLED);
    }
}

void ESP32S3_RGB::tickGreenLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_GREEN;
        _updateLED();
        _tickerGreen.attach(seconds / 2.0, _toggleGreenLED);
    }
}

void ESP32S3_RGB::tickBlueLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_BLUE;
        _updateLED();
        _tickerBlue.attach(seconds / 2.0, _toggleBlueLED);
    }
}

void ESP32S3_RGB::tickYellowLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_YELLOW;
        _updateLED();
        _tickerYellow.attach(seconds / 2.0, _toggleYellowLED);
    }
}

void ESP32S3_RGB::tickPurpleLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_MAGENTA;
        _updateLED();
        _tickerPurple.attach(seconds / 2.0, _togglePurpleLED);
    }
}

