tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
void ESP32S3_RGB::tickOrangeLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = 0xFF8000;  // Orange: R=255, G=128, B=0
        _updateLED();
        _tickerOrange.attach(seconds / 2.0, _toggleOrangeLED);
    }
}

void ESP32S3_RGB::tickWhiteLED(float seconds) {
    if (seconds <= 0) {
        _stopAllLEDs();
    } else {
        _stopAllLEDs();
        _currentColor = COLOR_WHITE;
        _updateLED();
        _tickerWhite.attach(seconds / 2.0, _toggleWhiteLED);
    }
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::setBrightness
 * DESCRIPTION: Sets the brightness level of the RGB LED.
 * PARAMETERS:  brightness - Brightness level (0-255, where 0=off, 255=full brightness)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::setBrightness(uint8_t brightness) {
    _brightness = brightness;
}

void ESP32S3_RGB::update() {
    _updateLED();
}

void ESP32S3_RGB::_initializeGPIO() {
    // Initialization is handled by NeoPixel begin()
    // No GPIO setup needed here
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::_rgbToGrb
 * DESCRIPTION: Converts RGB color format to GRB format for NeoPixel.
 *              WS2812B LEDs use GRB order internally.
 * PARAMETERS:  rgbColor - Color in RGB format (0xRRGGBB)
 * RETURNED:    Color in GRB format (0xGGRRBB) for NeoPixel
 ***********************************************************************/
uint32_t ESP32S3_RGB::_rgbToGrb(uint32_t rgbColor) {
    uint8_t r = (rgbColor >> 16) & 0xFF;
    uint8_t g = (rgbColor >> 8) & 0xFF;
    uint8_t b = rgbColor & 0xFF;
    
    // Return in GRB format for Adafruit_NeoPixel
    return ((uint32_t)g << 16) | ((uint32_t)r << 8) | b;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::_stopAllLEDs
 * DESCRIPTION: Stops all LED Ticker animations and turns off LED.
 *              Called before starting a new LED animation.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::_stopAllLEDs() {
    _tickerRed.detach();
    _tickerGreen.detach();
    _tickerBlue.detach();
    _tickerYellow.detach();
    _tickerPurple.detach();
    _tickerOrange.detach();
    _tickerWhite.detach();
    _currentColor = COLOR_OFF;
    _updateLED();
}

/***********************************************************************
 * FUNCTION:    ESP32S3_RGB::_toggleLED
 * DESCRIPTION: Toggles LED between a specified color and OFF.
 *              Called by Ticker callback for blinking animation.
 * PARAMETERS:  color - Color to toggle to (when switching from OFF)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_RGB::_toggleLED(uint32_t color) {
    if (_currentColor == COLOR_OFF) {
        _currentColor = color;
    } else {
        _currentColor = COLOR_OFF;
    }
    _updateLED();
}

void ESP32S3_RGB::_updateLED() {
    if (_neoPixel == nullptr) return;
    
    if (_animMode == ANIM_SOLID) {
        // Solid color display
        uint32_t displayColor = _rgbToGrb(_currentColor);
        
        // Apply brightness
        uint8_t r = (displayColor >> 8) & 0xFF;
        uint8_t g = (displayColor >> 16) & 0xFF;
        uint8_t b = displayColor & 0xFF;
        
        r = (r * _brightness) / 255;
        g = (g * _brightness) / 255;
        b = (b * _brightness) / 255;
        
        _neoPixel->setPixelColor(0, g, r, b);
        _neoPixel->show();
        
    } else if (_animMode == ANIM_BLINK) {
        // Blinking animation
        unsigned long elapsed = millis() - _lastUpdateTime;
        uint32_t cycleTime = _blinkOnTime + _blinkOffTime;
        unsigned long pos = elapsed % cycleTime;
        
        uint32_t displayColor = _rgbToGrb(_currentColor);
        
        uint8_t r = (displayColor >> 8) & 0xFF;
        uint8_t g = (displayColor >> 16) & 0xFF;
        uint8_t b = displayColor & 0xFF;
        
        r = (r * _brightness) / 255;
        g = (g * _brightness) / 255;
        b = (b * _brightness) / 255;
        
        if (pos < _blinkOnTime) {
            // LED ON
            _neoPixel->setPixelColor(0, g, r, b);
        } else {
            // LED OFF
            _neoPixel->setPixelColor(0, 0, 0, 0);
        }
        
        _neoPixel->show();
        
    } else if (_animMode == ANIM_PULSE) {
        // Pulse/breathe animation
        unsigned long elapsed = millis() - _lastUpdateTime;
        unsigned long pos = elapsed % _blinkOnTime;
        
        // Calculate brightness wave (0-255 and back)
        uint8_t brightness = (pos < _blinkOnTime / 2) ? 
                            (pos * 510 / _blinkOnTime) :
                            (510 - pos * 510 / _blinkOnTime);
        
        uint32_t displayColor = _rgbToGrb(_currentColor);
        
        uint8_t r = (displayColor >> 8) & 0xFF;
        uint8_t g = (displayColor >> 16) & 0xFF;
        uint8_t b = displayColor & 0xFF;
        
        r = (r * brightness * _brightness) / (255 * 255);
        g = (g * brightness * _brightness) / (255 * 255);
        b = (b * brightness * _brightness) / (255 * 255);
        
        _neoPixel->setPixelColor(0, g, r, b);
        _neoPixel->show();
    }
}

void ESP32S3_RGB::_applyBrightness(uint8_t &r, uint8_t &g, uint8_t &b) {
    r = (r * _brightness) / 255;
    g = (g * _brightness) / 255;
    b = (b * _brightness) / 255;
}

// ============================================================
// STATIC TICKER CALLBACK FUNCTIONS (called by Ticker ISR)
// ============================================================
void ESP32S3_RGB::_toggleRedLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_RED);
    }
}

void ESP32S3_RGB::_toggleGreenLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_GREEN);
    }
}

void ESP32S3_RGB::_toggleBlueLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_BLUE);
    }
}

void ESP32S3_RGB::_toggleYellowLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_YELLOW);
    }
}

void ESP32S3_RGB::_togglePurpleLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_MAGENTA);
    }
}

void ESP32S3_RGB::_toggleOrangeLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(0xFF8000);  // Orange
    }
}

