tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
void ESP32S3_RGB::_toggleWhiteLED() {
    if (_instance != nullptr) {
        _instance->_toggleLED(COLOR_WHITE);
    }
}

// ============================================================
// SECTION 5: BUZZER IMPLEMENTATION
// ============================================================

ESP32S3_Buzzer::ESP32S3_Buzzer()
    : _frequency(DEFAULT_FREQ), _currentVolume(0), _isPlaying(false),
      _playStartTime(0), _playDuration(0), _sequence(nullptr),
      _sequenceCount(0), _sequenceIndex(0), _sequenceStartTime(0) {}

bool ESP32S3_Buzzer::begin(uint16_t frequency) {
    _frequency = frequency;
    _initializeGPIO();
    return true;
}

void ESP32S3_Buzzer::end() {
    ledcDetachPin(BUZZER_PIN);
    digitalWrite(BUZZER_PIN, LOW);
}

void ESP32S3_Buzzer::on() {
    setVolume(MAX_DUTY);
    _isPlaying = true;
}

void ESP32S3_Buzzer::off() {
    setVolume(0);
    _isPlaying = false;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_Buzzer::setVolume
 * DESCRIPTION: Sets the buzzer volume using PWM duty cycle.
 *              Uses LEDC channel 1 at 1kHz frequency for proper sound.
 * PARAMETERS:  volume - Volume level (0-255, where 0=silent, 255=max volume)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_Buzzer::setVolume(uint8_t volume) {
    _currentVolume = volume;
    // Use LEDC to generate PWM at buzzer frequency
    // ledcWrite maps duty cycle 0-255 to PWM output
    ledcWrite(PWM_CHANNEL, volume);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_Buzzer::beep
 * DESCRIPTION: Produces a beep sound for a specified duration.
 *              Uses LEDC PWM to generate precise 1kHz tone.
 * PARAMETERS:  duration - Beep duration in milliseconds (1-5000)
 *              volume - Volume level (0-255, where 0=silent, 255=full volume)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_Buzzer::beep(uint16_t duration, uint8_t volume) {
    // Constrain volume and duration to safe ranges
    volume = constrain(volume, 0, 255);
    duration = constrain(duration, 1, 5000);
    
    // Turn buzzer ON with specified volume (PWM duty cycle)
    ledcWrite(PWM_CHANNEL, volume);
    delay(duration);
    
    // Turn buzzer OFF
    ledcWrite(PWM_CHANNEL, 0);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_Buzzer::playPattern
 * DESCRIPTION: Plays predefined beep patterns for status indication.
 * PARAMETERS:  pattern - Pattern type (SHORT, LONG, DOUBLE, TRIPLE, ALARM, WARNING)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_Buzzer::playPattern(BuzzerPattern pattern) {
    switch (pattern) {
        case PATTERN_SHORT:
            beep(100);
            break;
        case PATTERN_LONG:
            beep(500);
            break;
        case PATTERN_DOUBLE:
        case PATTERN_TRIPLE:
        case PATTERN_ALARM:
        case PATTERN_WARNING:
            beep(100);
            break;
    }
}

void ESP32S3_Buzzer::playSequence(const uint16_t* sequence, uint8_t count, uint8_t volume) {
    _sequence = sequence;
    _sequenceCount = count;
    _sequenceIndex = 0;
    _currentVolume = volume;
    _sequenceStartTime = millis();
    _isPlaying = true;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_Buzzer::setFrequency
 * DESCRIPTION: Sets the PWM frequency of the buzzer sound.
 *              Uses LEDC to change the frequency on the configured channel.
 * PARAMETERS:  frequency - Frequency in Hz (typical: 1000Hz for standard buzzer)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_Buzzer::setFrequency(uint16_t frequency) {
    _frequency = frequency;
    // Change the LEDC frequency on channel 1
    // ledcChangeFrequency(channel, frequency, resolution)
    ledcChangeFrequency(PWM_CHANNEL, frequency, PWM_RESOLUTION);
}

String ESP32S3_Buzzer::getStatus() {
    return _isPlaying ? "Playing" : "Idle";
}

/***********************************************************************
 * FUNCTION:    ESP32S3_Buzzer::stop
 * DESCRIPTION: Stops the buzzer immediately and clears any active sound sequence.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_Buzzer::stop() {
    off();
    _isPlaying = false;
    _sequence = nullptr;
}

void ESP32S3_Buzzer::update() {
    _updatePlayback();
}

void ESP32S3_Buzzer::_initializeGPIO() {
    // Configure LEDC (PWM) for buzzer
    // ledcSetup(channel, frequency, resolution)
    // PWM_CHANNEL: 1 (ESP32 has 16 channels, 0-15)
    // DEFAULT_FREQ: 1000 Hz (standard buzzer frequency)
    // PWM_RESOLUTION: 8 bits (0-255 duty cycle)
    
    ledcSetup(PWM_CHANNEL, DEFAULT_FREQ, PWM_RESOLUTION);
    
    // Attach GPIO46 to PWM channel 1
    ledcAttachPin(BUZZER_PIN, PWM_CHANNEL);
    
    // Ensure buzzer is off initially
    ledcWrite(PWM_CHANNEL, 0);
}

void ESP32S3_Buzzer::_updatePlayback() {
    if (!_isPlaying) return;
    
    if (_sequence != nullptr) {
        // Sequence playback
        // TODO: Implement sequence playback
    } else if (_playDuration > 0) {
        // Single beep playback
        unsigned long elapsed = millis() - _playStartTime;
        if (elapsed >= _playDuration) {
            off();
        }
    }
}

// ============================================================
// SECTION 6: MAIN BOARD CONTROLLER IMPLEMENTATION
// ============================================================

ESP32S3_8DI8DO::ESP32S3_8DI8DO()
    : _di(), _do(), _rs485(), _rgb(), _buzzer(),
      initialized(false), ethernet_connected(false),
      rs485_enabled(false), can_enabled(false),
      _status(STATUS_INIT_FAILED) {}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::begin
 * DESCRIPTION: Initializes the entire ESP32-S3-POE-ETH-8DI-8DO board.
 *              Configures all subsystems (DI, DO, RS485, RGB, Buzzer).
 * PARAMETERS:  None
 * RETURNED:    Status - STATUS_OK if successful, error code otherwise
 ***********************************************************************/
ESP32S3_8DI8DO::Status ESP32S3_8DI8DO::begin() {
    // Configure GPIO pins
    configurePins();
    Serial.println("✓ GPIO pins configured");
    
    // Initialize LED
    initLED();
    Serial.println("✓ RGB LED initialized");
    
    // Initialize Buzzer
    initBuzzer();
    Serial.println("✓ Buzzer initialized");
    
    // Initialize subsystems
    if (!_di.begin()) {
        _status = STATUS_DI_ERROR;
        return _status;
    }
    
    if (!_do.begin()) {
        _status = STATUS_DO_ERROR;
        return _status;
    }
    
    if (!_rs485.begin()) {
        _status = STATUS_RS485_ERROR;
        return _status;
    }
    
