tenergyinnovation/ESP32-S3-POE-ETH-8DI-8DO/src/ESP32S3_8DI8DO.cpp
    if (!_rgb.begin()) {
        _status = STATUS_RGB_ERROR;
        return _status;
    }
    
    if (!_buzzer.begin()) {
        _status = STATUS_SYSTEM_ERROR;
        return _status;
    }
    
    initialized = true;
    _status = STATUS_OK;
    Serial.println("✅ Board initialization complete!\n");
    return _status;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::setRGBColor
 * DESCRIPTION: Convenience method to set RGB LED color from main board class.
 * PARAMETERS:  red - Red component (0-255)
 *              green - Green component (0-255)
 *              blue - Blue component (0-255)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::setRGBColor(uint8_t red, uint8_t green, uint8_t blue) {
    _rgb.setColor(red, green, blue);
}

void ESP32S3_8DI8DO::LEDOff() {
    // Stop all LED animations (Ticker-based)
    _rgb.setColor(0, 0, 0);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::setDigitalOutput
 * DESCRIPTION: Sets the state of a digital output relay.
 * PARAMETERS:  channel - The digital output channel (0-7)
 *              state - HIGH or 1 to turn ON, LOW or 0 to turn OFF
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::setDigitalOutput(uint8_t channel, uint8_t state) {
    if (state) {
        _do.on(channel);
    } else {
        _do.off(channel);
    }
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::getDigitalInput
 * DESCRIPTION: Reads the current state of a digital input channel.
 * PARAMETERS:  channel - The digital input channel (0-7)
 * RETURNED:    uint8_t - 1 if HIGH, 0 if LOW
 ***********************************************************************/
uint8_t ESP32S3_8DI8DO::getDigitalInput(uint8_t channel) {
    return _di.read(channel) ? 1 : 0;
}

uint8_t ESP32S3_8DI8DO::readAllInputs() {
    return _di.readAll();
}

void ESP32S3_8DI8DO::setAllOutputs(uint8_t value) {
    _do.setMask(value);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::buzzerBeep
 * DESCRIPTION: Produces multiple beep sounds with specified timing.
 *              Uses blocking delay for precise beep timing control.
 * PARAMETERS:  times - Number of beeps
 *              duration - Duration of each beep in milliseconds (default: 100ms)
 *              interval - Interval between beeps in milliseconds (default: 100ms)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::buzzerBeep(uint8_t times, uint16_t duration, uint16_t interval) {
    times = constrain(times, 1, 20);  // Limit to 1-20 beeps
    
    for (uint8_t i = 0; i < times; i++) {
        _buzzer.beep(duration, 200);  // Beep at volume 200 (moderate-loud)
        
        // Pause between beeps (except after last beep)
        if (i < times - 1) {
            delay(interval);
        }
    }
}

bool ESP32S3_8DI8DO::setupEthernet() {
    ethernet_connected = true;
    return true;
}

bool ESP32S3_8DI8DO::setupRS485(uint32_t baudRate) {
    rs485_enabled = _rs485.begin(baudRate);
    return rs485_enabled;
}

bool ESP32S3_8DI8DO::setupLoRaDTU(uint32_t baudRate) {
    return setupRS485(baudRate);
}

bool ESP32S3_8DI8DO::setupCAN(uint32_t baudRate) {
    can_enabled = true;
    return true;
}

String ESP32S3_8DI8DO::getBoardInfo() {
    String info = "=== ESP32-S3-POE-ETH-8DI-8DO Board ===\n";
    info += "Library Version: " + String(LIBRARY_VERSION) + "\n";
    info += "Status: " + String(initialized ? "Ready" : "Not Initialized") + "\n";
    info += "Ethernet: " + String(ethernet_connected ? "Connected" : "Disconnected") + "\n";
    info += "RS485: " + String(rs485_enabled ? "Enabled" : "Disabled") + "\n";
    info += "CAN: " + String(can_enabled ? "Enabled" : "Disabled") + "\n";
    return info;
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::loop
 * DESCRIPTION: Updates all subsystems and must be called in the main loop.
 *              Handles debouncing, animations, LED blinking, and other periodic tasks.
 * PARAMETERS:  None
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::loop() {
    _di.update();
    _rs485.update();
    _rgb.update();
    _buzzer.update();
    
    // Note: LED blinking animations are now handled by FreeRTOS Ticker in background ISR context.
    // This is non-blocking and allows the main loop to remain responsive.
    // See: TickRedLED(), TickGreenLED(), etc. and Ticker callback methods in ESP32S3_RGB class.
}

void ESP32S3_8DI8DO::configurePins() {
    // Configure DI pins as input
    for (int i = 0; i < DI_CHANNELS; i++) {
        pinMode(ESP32S3_DI::DI_PINS[i], INPUT);
    }
    
    // Configure RS485 pins
    pinMode(RS485_TX_PIN, OUTPUT);
    pinMode(RS485_RX_PIN, INPUT);
    pinMode(21, OUTPUT);  // RTS pin
}

void ESP32S3_8DI8DO::initLED() {
    _rgb.begin();
    _rgb.setColor(0, 0, 0);  // Off
}

void ESP32S3_8DI8DO::initBuzzer() {
    _buzzer.begin();
    _buzzer.off();
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::buzzer_beep
 * DESCRIPTION: Produces multiple rapid beep sounds with 100ms intervals.
 *              Simplified function for quick buzzer control.
 * PARAMETERS:  times - Number of beeps to produce (1-10 recommended)
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::buzzer_beep(int times) {
    buzzerBeep(times, 100, 100);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickRedLED
 * DESCRIPTION: Makes the RGB LED blink red using Ticker (non-blocking).
 *              Uses FreeRTOS background timer for efficient animation.
 * PARAMETERS:  seconds - Blink interval in seconds (0.1 to 10.0 recommended)
 *              Pass 0 to turn off.
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickRedLED(float seconds) {
    _rgb.tickRedLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickGreenLED
 * DESCRIPTION: Makes the RGB LED blink green using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickGreenLED(float seconds) {
    _rgb.tickGreenLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickBlueLED
 * DESCRIPTION: Makes the RGB LED blink blue using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickBlueLED(float seconds) {
    _rgb.tickBlueLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickYellowLED
 * DESCRIPTION: Makes the RGB LED blink yellow using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickYellowLED(float seconds) {
    _rgb.tickYellowLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickPurpleLED
 * DESCRIPTION: Makes the RGB LED blink purple using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickPurpleLED(float seconds) {
    _rgb.tickPurpleLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickOrangeLED
 * DESCRIPTION: Makes the RGB LED blink orange using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickOrangeLED(float seconds) {
    _rgb.tickOrangeLED(seconds);
}

/***********************************************************************
 * FUNCTION:    ESP32S3_8DI8DO::TickWhiteLED
 * DESCRIPTION: Makes the RGB LED blink white using Ticker (non-blocking).
 * PARAMETERS:  seconds - Blink interval in seconds
 * RETURNED:    None
 ***********************************************************************/
void ESP32S3_8DI8DO::TickWhiteLED(float seconds) {
    _rgb.tickWhiteLED(seconds);
}

